    класс Узел
    {
         Узел ЛевыйПотомок { get; set; }
         Узел ПравыйПотомок { get; set; }
         int НомерСтатьи { get; set; }
         bool НайденнаяСтатьяНеСуществует  { get; set; }

        Узел(int НомерИскомойСтатьи)
        {
            НомерСтатьи = НомерИскомойСтатьи;
        }

         Узел Найти(int НомерИскомойСтатьи)
        {
            //Стартовый узел
            Узел ТекущийУзел = this;

            while (ТекушийУзел НЕРАВЕН null)
            {
                if (НомерИскомойСтатьи РАВЕН ТекущийУзел.НомерСтатьи)//если номер статьи равен значению узла
                {
                    if (ТекущийУзел.ПравыйПотомок НЕРАВЕН null)
                    {
                        return ТекущийУзел.ПравыйПотомок;
                    }
                    if (ТекущийУзел.ПравыйПотомок РАВЕН null)
                    {
                        ТекущийУзел.НайденнаяСтатьяНеСуществует  = true;
                        return ТекущийУзел;//Статья не найдена
                    }
                }
                else if (НомерИскомойСтатьи > ТекущийУзел.НомерСтатьи)//если номер статьи больше значения узла, перейдите к правому дочернему элементу
                {
                    ТекущийУзел = ТекущийУзел.ПравыйПотомок;
                }
                else// если номер статьи меньше данных текущего узла, перейти к левому дочернему узлу
                {
                    ТекущийУзел = ТекущийУзел.ЛевыйПотомок;
                }
            }
            //Статья не найдена
            ТекущийУзел.НайденнаяСтатьяНеСуществует  = true;
            return ТекущийУзел;
        }
    }

     класс ДеревоСтатей
     {
        private Узел кореньДерева;
        public Узел КореньДерева
        {
            get { return кореньДерева; }
        }

        public Узел Найти(int НомерИскомойСтатьи)
        {
            if (кореньДерева НЕРАВЕН null)
            {
                return кореньДерева.Найти(НомерИскомойСтатьи);
            }
            else
            {
                return null;
            }
        }
     }